In [0]:
import pandas as pd

In [2]:
# read a dataset of UFO reports into a DataFrame
ufo = pd.read_table('http://bit.ly/uforeports', sep=',')

/usr/local/lib/python3.6/dist-packages/ipykernel_launcher.py:1: FutureWarning: read_table is deprecated, use read_csv instead.
  """Entry point for launching an IPython kernel.

In [3]:
ufo.head()

                   City Colors Reported Shape Reported State             Time
0                Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1           Willingboro             NaN          OTHER    NJ  6/30/1930 20:00
2               Holyoke             NaN           OVAL    CO  2/15/1931 14:00
3               Abilene             NaN           DISK    KS   6/1/1931 13:00
4  New York Worlds Fair             NaN          LIGHT    NY  4/18/1933 19:00

In [4]:
# select the 'City' Series using bracket notation
ufo['City'][0:6]

0                  Ithaca
1             Willingboro
2                 Holyoke
3                 Abilene
4    New York Worlds Fair
5             Valley City
Name: City, dtype: object

In [0]:
# or equivalently, use dot notation
#ufo.City

In [6]:
# create a new 'Location' Series (must use bracket notation to define the Series name)
ufo['Location'] = ufo.City + ', ' + ufo.State
ufo.head()

                   City  ...                  Location
0                Ithaca  ...                Ithaca, NY
1           Willingboro  ...           Willingboro, NJ
2               Holyoke  ...               Holyoke, CO
3               Abilene  ...               Abilene, KS
4  New York Worlds Fair  ...  New York Worlds Fair, NY

[5 rows x 6 columns]

**Rename columns in a pandas DataFrame**

In [7]:
# examine the column names
ufo.columns

Index(['City', 'Colors Reported', 'Shape Reported', 'State', 'Time',
       'Location'],
      dtype='object')

In [8]:
# rename two of the columns by using the 'rename' method
ufo.rename(columns={'Colors Reported':'Colors_Reported', 'Shape Reported':'Shape_Reported'}, inplace=True)
ufo.columns

Index(['City', 'Colors_Reported', 'Shape_Reported', 'State', 'Time',
       'Location'],
      dtype='object')

In [9]:
ufo.columns

Index(['City', 'Colors_Reported', 'Shape_Reported', 'State', 'Time',
       'Location'],
      dtype='object')

In [10]:
# replace all  underscores with spaces in the column names by using the 'str.replace' method
ufo.columns = ufo.columns.str.replace('_', ' ')
ufo.columns

Index(['City', 'Colors Reported', 'Shape Reported', 'State', 'Time',
       'Location'],
      dtype='object')

**Remove columns from a pandas DataFrame**

In [11]:
# remove a single column (axis=1 refers to columns)
ufo.drop('Colors Reported', axis=1, inplace=True)
ufo.head()

                   City  ...                  Location
0                Ithaca  ...                Ithaca, NY
1           Willingboro  ...           Willingboro, NJ
2               Holyoke  ...               Holyoke, CO
3               Abilene  ...               Abilene, KS
4  New York Worlds Fair  ...  New York Worlds Fair, NY

[5 rows x 5 columns]

In [12]:
# remove multiple columns at once
ufo.drop(['City', 'State'], axis=1, inplace=True)
ufo.head()

  Shape Reported             Time                  Location
0       TRIANGLE   6/1/1930 22:00                Ithaca, NY
1          OTHER  6/30/1930 20:00           Willingboro, NJ
2           OVAL  2/15/1931 14:00               Holyoke, CO
3           DISK   6/1/1931 13:00               Abilene, KS
4          LIGHT  4/18/1933 19:00  New York Worlds Fair, NY

In [13]:
# remove multiple rows at once (axis=0 refers to rows)
ufo.drop([0, 1], axis=0, inplace=True)
ufo.head()

  Shape Reported             Time                  Location
2           OVAL  2/15/1931 14:00               Holyoke, CO
3           DISK   6/1/1931 13:00               Abilene, KS
4          LIGHT  4/18/1933 19:00  New York Worlds Fair, NY
5           DISK  9/15/1934 15:30           Valley City, ND
6         CIRCLE   6/15/1935 0:00           Crater Lake, CA

**Sort a pandas DataFrame or a Series**

In [14]:
# read a dataset of top-rated IMDb movies into a DataFrame
movies = pd.read_csv('http://bit.ly/imdbratings')
movies.head()

   star_rating  ...                                        actors_list
0          9.3  ...  [u'Tim Robbins', u'Morgan Freeman', u'Bob Gunt...
1          9.2  ...    [u'Marlon Brando', u'Al Pacino', u'James Caan']
2          9.1  ...  [u'Al Pacino', u'Robert De Niro', u'Robert Duv...
3          9.0  ...  [u'Christian Bale', u'Heath Ledger', u'Aaron E...
4          8.9  ...  [u'John Travolta', u'Uma Thurman', u'Samuel L....

[5 rows x 6 columns]

In [15]:
# sort the 'title' Series in ascending order (returns a Series)
movies.title.sort_values().head()

542     (500) Days of Summer
5               12 Angry Men
201         12 Years a Slave
698                127 Hours
110    2001: A Space Odyssey
Name: title, dtype: object

In [16]:
# sort in descending order instead
movies.title.sort_values(ascending=False).head()

864               [Rec]
526                Zulu
615          Zombieland
677              Zodiac
955    Zero Dark Thirty
Name: title, dtype: object

In [17]:
# sort the entire DataFrame by the 'title' Series (returns a DataFrame)
movies.sort_values('title').head()

     star_rating  ...                                        actors_list
542          7.8  ...  [u'Zooey Deschanel', u'Joseph Gordon-Levitt', ...
5            8.9  ...  [u'Henry Fonda', u'Lee J. Cobb', u'Martin Bals...
201          8.1  ...  [u'Chiwetel Ejiofor', u'Michael Kenneth Willia...
698          7.6  ...  [u'James Franco', u'Amber Tamblyn', u'Kate Mara']
110          8.3  ...  [u'Keir Dullea', u'Gary Lockwood', u'William S...

[5 rows x 6 columns]

In [18]:
# sort in descending order instead
movies.sort_values('title', ascending=False).head()

     star_rating  ...                                        actors_list
864          7.5  ...  [u'Manuela Velasco', u'Ferran Terraza', u'Jorg...
526          7.8  ...  [u'Stanley Baker', u'Jack Hawkins', u'Ulla Jac...
615          7.7  ...  [u'Jesse Eisenberg', u'Emma Stone', u'Woody Ha...
677          7.7  ...  [u'Jake Gyllenhaal', u'Robert Downey Jr.', u'M...
955          7.4  ...  [u'Jessica Chastain', u'Joel Edgerton', u'Chri...

[5 rows x 6 columns]

In [19]:
# sort the DataFrame first by 'content_rating', then by 'duration'
movies.sort_values(['content_rating', 'duration']).head()

     star_rating  ...                                        actors_list
713          7.6  ...  [u'Phil Harris', u'Sebastian Cabot', u'Louis P...
513          7.8  ...  [u'Kevin McCarthy', u'Dana Wynter', u'Larry Ga...
272          8.1  ...  [u'Sterling Hayden', u'Coleen Gray', u'Vince E...
703          7.6  ...  [u'Bela Lugosi', u'Helen Chandler', u'David Ma...
612          7.7  ...  [u'John Lennon', u'Paul McCartney', u'George H...

[5 rows x 6 columns]

**Filter rows of a pandas DataFrame by column value**

In [20]:
movies.shape

(979, 6)

In [0]:
# create a list in which each element refers to a DataFrame row: True if the row satisfies the condition, False otherwise
booleans = []
for length in movies.duration:
    if length >= 200:
        booleans.append(True)
    else:
        booleans.append(False)

In [22]:
# confirm that the list has the same length as the DataFrame
len(booleans)

979

In [23]:
# examine the first five list elements
booleans[0:5]

[False, False, True, False, False]

In [24]:
# convert the list to a Series
is_long = pd.Series(booleans)
is_long.head()

0    False
1    False
2     True
3    False
4    False
dtype: bool

In [25]:
# use bracket notation with the boolean Series to tell the DataFrame which rows to display
movies[is_long]

     star_rating  ...                                        actors_list
2            9.1  ...  [u'Al Pacino', u'Robert De Niro', u'Robert Duv...
7            8.9  ...  [u'Elijah Wood', u'Viggo Mortensen', u'Ian McK...
17           8.7  ...  [u'Toshir\xf4 Mifune', u'Takashi Shimura', u'K...
78           8.4  ...  [u'Robert De Niro', u'James Woods', u'Elizabet...
85           8.4  ...  [u"Peter O'Toole", u'Alec Guinness', u'Anthony...
142          8.3  ...  [u'Aamir Khan', u'Gracy Singh', u'Rachel Shell...
157          8.2  ...  [u'Clark Gable', u'Vivien Leigh', u'Thomas Mit...
204          8.1  ...  [u'Charlton Heston', u'Jack Hawkins', u'Stephe...
445          7.9  ...  [u'Charlton Heston', u'Yul Brynner', u'Anne Ba...
476          7.8  ...  [u'Kenneth Branagh', u'Julie Christie', u'Dere...
630          7.7  ...  [u'Denzel Washington', u'Angela Bassett', u'De...
767          7.6  ...  [u'Spencer Tracy', u'Milton Berle', u'Ethel Me...

[12 rows x 6 columns]

In [26]:
# simplify the steps above: no need to write a for loop to create 'is_long' since pandas will broadcast the comparison
is_long = movies.duration >= 200
movies[is_long]

# or equivalently, write it in one line (no need to create the 'is_long' object)
movies[movies.duration >= 200]

     star_rating  ...                                        actors_list
2            9.1  ...  [u'Al Pacino', u'Robert De Niro', u'Robert Duv...
7            8.9  ...  [u'Elijah Wood', u'Viggo Mortensen', u'Ian McK...
17           8.7  ...  [u'Toshir\xf4 Mifune', u'Takashi Shimura', u'K...
78           8.4  ...  [u'Robert De Niro', u'James Woods', u'Elizabet...
85           8.4  ...  [u"Peter O'Toole", u'Alec Guinness', u'Anthony...
142          8.3  ...  [u'Aamir Khan', u'Gracy Singh', u'Rachel Shell...
157          8.2  ...  [u'Clark Gable', u'Vivien Leigh', u'Thomas Mit...
204          8.1  ...  [u'Charlton Heston', u'Jack Hawkins', u'Stephe...
445          7.9  ...  [u'Charlton Heston', u'Yul Brynner', u'Anne Ba...
476          7.8  ...  [u'Kenneth Branagh', u'Julie Christie', u'Dere...
630          7.7  ...  [u'Denzel Washington', u'Angela Bassett', u'De...
767          7.6  ...  [u'Spencer Tracy', u'Milton Berle', u'Ethel Me...

[12 rows x 6 columns]

In [27]:
# select the 'genre' Series from the filtered DataFrame
movies[movies.duration >= 200].genre

# or equivalently, use the 'loc' method
movies.loc[movies.duration >= 200, 'genre']

2          Crime
7      Adventure
17         Drama
78         Crime
85     Adventure
142    Adventure
157        Drama
204    Adventure
445    Adventure
476        Drama
630    Biography
767       Action
Name: genre, dtype: object

**Apply multiple filter criteria to a pandas DataFrame**

In [28]:
# read a dataset of top-rated IMDb movies into a DataFrame
movies = pd.read_csv('http://bit.ly/imdbratings')
movies.head()


# filter the DataFrame to only show movies with a 'duration' of at least 200 minutes
movies[movies.duration >= 200]

     star_rating  ...                                        actors_list
2            9.1  ...  [u'Al Pacino', u'Robert De Niro', u'Robert Duv...
7            8.9  ...  [u'Elijah Wood', u'Viggo Mortensen', u'Ian McK...
17           8.7  ...  [u'Toshir\xf4 Mifune', u'Takashi Shimura', u'K...
78           8.4  ...  [u'Robert De Niro', u'James Woods', u'Elizabet...
85           8.4  ...  [u"Peter O'Toole", u'Alec Guinness', u'Anthony...
142          8.3  ...  [u'Aamir Khan', u'Gracy Singh', u'Rachel Shell...
157          8.2  ...  [u'Clark Gable', u'Vivien Leigh', u'Thomas Mit...
204          8.1  ...  [u'Charlton Heston', u'Jack Hawkins', u'Stephe...
445          7.9  ...  [u'Charlton Heston', u'Yul Brynner', u'Anne Ba...
476          7.8  ...  [u'Kenneth Branagh', u'Julie Christie', u'Dere...
630          7.7  ...  [u'Denzel Washington', u'Angela Bassett', u'De...
767          7.6  ...  [u'Spencer Tracy', u'Milton Berle', u'Ethel Me...

[12 rows x 6 columns]

In [29]:
#  use the '&' operator to specify that both conditions are required
movies[(movies.duration >=200) & (movies.genre == 'Drama')]

     star_rating  ...                                        actors_list
17           8.7  ...  [u'Toshir\xf4 Mifune', u'Takashi Shimura', u'K...
157          8.2  ...  [u'Clark Gable', u'Vivien Leigh', u'Thomas Mit...
476          7.8  ...  [u'Kenneth Branagh', u'Julie Christie', u'Dere...

[3 rows x 6 columns]

In [30]:
#  using the '|' operator would have shown movies that are either long or dramas (or both)
movies[(movies.duration >=200) | (movies.genre == 'Drama')].head()

    star_rating  ...                                        actors_list
2           9.1  ...  [u'Al Pacino', u'Robert De Niro', u'Robert Duv...
5           8.9  ...  [u'Henry Fonda', u'Lee J. Cobb', u'Martin Bals...
7           8.9  ...  [u'Elijah Wood', u'Viggo Mortensen', u'Ian McK...
9           8.9  ...  [u'Brad Pitt', u'Edward Norton', u'Helena Bonh...
13          8.8  ...    [u'Tom Hanks', u'Robin Wright', u'Gary Sinise']

[5 rows x 6 columns]

In [31]:
# use the '|' operator to specify that a row can match any of the three criteria
movies[(movies.genre == 'Crime') | (movies.genre == 'Drama') | (movies.genre == 'Action')].head(10)

# or equivalently, use the 'isin' method
movies[movies.genre.isin(['Crime', 'Drama', 'Action'])].head(10)

    star_rating  ...                                        actors_list
0           9.3  ...  [u'Tim Robbins', u'Morgan Freeman', u'Bob Gunt...
1           9.2  ...    [u'Marlon Brando', u'Al Pacino', u'James Caan']
2           9.1  ...  [u'Al Pacino', u'Robert De Niro', u'Robert Duv...
3           9.0  ...  [u'Christian Bale', u'Heath Ledger', u'Aaron E...
4           8.9  ...  [u'John Travolta', u'Uma Thurman', u'Samuel L....
5           8.9  ...  [u'Henry Fonda', u'Lee J. Cobb', u'Martin Bals...
9           8.9  ...  [u'Brad Pitt', u'Edward Norton', u'Helena Bonh...
11          8.8  ...  [u'Leonardo DiCaprio', u'Joseph Gordon-Levitt'...
12          8.8  ...  [u'Mark Hamill', u'Harrison Ford', u'Carrie Fi...
13          8.8  ...    [u'Tom Hanks', u'Robin Wright', u'Gary Sinise']

[10 rows x 6 columns]

**Drop all non-numeric columns from a DataFrame**

In [32]:
# read a dataset of alcohol consumption into a DataFrame, and check the data types
drinks = pd.read_csv('http://bit.ly/drinksbycountry')
drinks.dtypes

country                          object
beer_servings                     int64
spirit_servings                   int64
wine_servings                     int64
total_litres_of_pure_alcohol    float64
continent                        object
dtype: object

In [33]:
drinks.head()

       country  beer_servings  ...  total_litres_of_pure_alcohol  continent
0  Afghanistan              0  ...                           0.0       Asia
1      Albania             89  ...                           4.9     Europe
2      Algeria             25  ...                           0.7     Africa
3      Andorra            245  ...                          12.4     Europe
4       Angola            217  ...                           5.9     Africa

[5 rows x 6 columns]

In [34]:
# only include numeric columns in the DataFrame
import numpy as np
drinks.select_dtypes(include=[np.number]).dtypes

beer_servings                     int64
spirit_servings                   int64
wine_servings                     int64
total_litres_of_pure_alcohol    float64
dtype: object

In [35]:
drinks.columns

Index(['country', 'beer_servings', 'spirit_servings', 'wine_servings',
       'total_litres_of_pure_alcohol', 'continent'],
      dtype='object')

In [36]:
drinks.select_dtypes(include=['int']) .head()

   beer_servings  spirit_servings  wine_servings
0              0                0              0
1             89              132             54
2             25                0             14
3            245              138            312
4            217               57             45

**Describe Dataframes / Numeric Columns**

In [37]:
drinks.describe()

       beer_servings  ...  total_litres_of_pure_alcohol
count     193.000000  ...                    193.000000
mean      106.160622  ...                      4.717098
std       101.143103  ...                      3.773298
min         0.000000  ...                      0.000000
25%        20.000000  ...                      1.300000
50%        76.000000  ...                      4.200000
75%       188.000000  ...                      7.200000
max       376.000000  ...                     14.400000

[8 rows x 4 columns]

In [38]:
# pass the string 'all' to describe all columns
drinks.describe(include='all')

       country  beer_servings  ...  total_litres_of_pure_alcohol  continent
count      193     193.000000  ...                    193.000000        193
unique     193            NaN  ...                           NaN          6
top      Italy            NaN  ...                           NaN     Africa
freq         1            NaN  ...                           NaN         53
mean       NaN     106.160622  ...                      4.717098        NaN
std        NaN     101.143103  ...                      3.773298        NaN
min        NaN       0.000000  ...                      0.000000        NaN
25%        NaN      20.000000  ...                      1.300000        NaN
50%        NaN      76.000000  ...                      4.200000        NaN
75%        NaN     188.000000  ...                      7.200000        NaN
max        NaN     376.000000  ...                     14.400000        NaN

[11 rows x 6 columns]

In [39]:
# pass a list of data types to only describe certain types
drinks.describe(include=['object', 'float64'])

       country  total_litres_of_pure_alcohol continent
count      193                    193.000000       193
unique     193                           NaN         6
top      Italy                           NaN    Africa
freq         1                           NaN        53
mean       NaN                      4.717098       NaN
std        NaN                      3.773298       NaN
min        NaN                      0.000000       NaN
25%        NaN                      1.300000       NaN
50%        NaN                      4.200000       NaN
75%        NaN                      7.200000       NaN
max        NaN                     14.400000       NaN

In [40]:
# pass a list even if you only want to describe a single data type
drinks.describe(include=['object'])

       country continent
count      193       193
unique     193         6
top      Italy    Africa
freq         1        53

**Use the "axis" parameter in pandas**



```
When referring to rows or columns with the axis parameter:

axis 0 refers to rows
axis 1 refers to columns
```

In [41]:
# read a dataset of alcohol consumption into a DataFrame
drinks = pd.read_csv('http://bit.ly/drinksbycountry')

# drop a column (temporarily)
drinks.drop('continent', axis=1).head()

       country  beer_servings  ...  wine_servings  total_litres_of_pure_alcohol
0  Afghanistan              0  ...              0                           0.0
1      Albania             89  ...             54                           4.9
2      Algeria             25  ...             14                           0.7
3      Andorra            245  ...            312                          12.4
4       Angola            217  ...             45                           5.9

[5 rows x 5 columns]

In [42]:
# drop a row (temporarily)
drinks.drop(2, axis=0).head()

             country  ...      continent
0        Afghanistan  ...           Asia
1            Albania  ...         Europe
3            Andorra  ...         Europe
4             Angola  ...         Africa
5  Antigua & Barbuda  ...  North America

[5 rows x 6 columns]

In [43]:
# calculate the mean of each numeric column
drinks.mean()

# or equivalently, specify the axis explicitly
drinks.mean(axis=0)

beer_servings                   106.160622
spirit_servings                  80.994819
wine_servings                    49.450777
total_litres_of_pure_alcohol      4.717098
dtype: float64

In [44]:
# calculate the mean of each row
drinks.mean(axis=1).head()

0      0.000
1     69.975
2      9.925
3    176.850
4     81.225
dtype: float64



```
When performing a mathematical operation with the axis parameter:

axis 0 means the operation should "move down" the row axis
axis 1 means the operation should "move across" the column axis
```

In [45]:
# 'index' is an alias for axis 0
drinks.mean(axis='index')

beer_servings                   106.160622
spirit_servings                  80.994819
wine_servings                    49.450777
total_litres_of_pure_alcohol      4.717098
dtype: float64

In [46]:
# 'columns' is an alias for axis 1
drinks.mean(axis='columns').head()

0      0.000
1     69.975
2      9.925
3    176.850
4     81.225
dtype: float64

**Change the data type of a pandas Series**

In [47]:
# read a dataset of alcohol consumption into a DataFrame
drinks = pd.read_csv('http://bit.ly/drinksbycountry')
drinks.head()

       country  beer_servings  ...  total_litres_of_pure_alcohol  continent
0  Afghanistan              0  ...                           0.0       Asia
1      Albania             89  ...                           4.9     Europe
2      Algeria             25  ...                           0.7     Africa
3      Andorra            245  ...                          12.4     Europe
4       Angola            217  ...                           5.9     Africa

[5 rows x 6 columns]

In [48]:
# examine the data type of each Series
drinks.dtypes

country                          object
beer_servings                     int64
spirit_servings                   int64
wine_servings                     int64
total_litres_of_pure_alcohol    float64
continent                        object
dtype: object

In [49]:
# change the data type of an existing Series
drinks['beer_servings'] = drinks.beer_servings.astype(float)
drinks.dtypes

country                          object
beer_servings                   float64
spirit_servings                   int64
wine_servings                     int64
total_litres_of_pure_alcohol    float64
continent                        object
dtype: object

In [50]:
# alternatively, change the data type of a Series while reading in a file
drinks = pd.read_csv('http://bit.ly/drinksbycountry', dtype={'beer_servings':float})
drinks.dtypes

country                          object
beer_servings                   float64
spirit_servings                   int64
wine_servings                     int64
total_litres_of_pure_alcohol    float64
continent                        object
dtype: object